[{"path": "blog/2023/rainbow-colormaps-are-not-all-bad-paper", "title": "Rainbow Colormaps Are Not All Bad (Paper)", "description": "Rainbow colormaps are among the most derided ideas in data visualization, second only to pie charts. And yet, people use them. Why? A recent paper looks at some of the reasons why they are so popular and points to research showing that they might not be so bad if used for the right tasks. There's even opportunity for interesting research in rainbow colormaps!", "date": "July 12, 2023", "tags": [""], "featuredImage": "https://media.eagereyes.org/wp-content/uploads/2023/07/rainbow-comparison.jpeg"}, {"path": "blog/2023/paper-notebooks-for-data-analysis-and-visualization", "title": "Paper: Notebooks for Data Analysis and Visualization", "description": "Computational notebooks offer an alternative to the common GUI-based tools used for data visualization and BI today. In this new paper, I talk about what they are, their pros and cons, and how research could fill in some important gaps.", "date": "May 01, 2023", "tags": ["paper"], "featuredImage": "https://media.eagereyes.org/wp-content/uploads/2023/05/Kosara-CGA-2023-thumb.png"}, {"path": "blog/2023/course-on-data-vis-fundamentals-and-best-practices", "title": "Course on Data Vis Fundamentals and Best Practices", "description": "I'm teaching a short course on data visualization for Observable. It's free, and you should join! Starts March 7.", "date": "February 23, 2023", "tags": [""], "featuredImage": "https://media.eagereyes.org/wp-content/uploads/2023/02/vis-course-thumb.png"}, {"path": "blog/2023/new-video-exploring-the-connections-between-companies-with-they-rule", "title": "New video: Exploring the connections between companies with They Rule", "description": "Josh On's They Rule is back, and I've made a video about it.", "date": "February 09, 2023", "tags": ["eagereyestv"], "featuredImage": "https://media.eagereyes.org/wp-content/uploads/2023/02/they-rule-thumb-4x3-1.jpeg"}, {"path": "blog/2022/site-changes-coming-how-to-follow-sites-and-where-ive-been", "title": "Site Changes Coming, How to Follow Sites, and Where I've Been", "description": "This site has been around for over 16 years now, and a lot has changed in the world during that time. I'm currently working on an overhaul and wanted to give everybody an idea of what I'm thinking about and why there has been little activity. In light of recent developments, here are also some good ways to follow good old-fashioned blogs and an alternative to Twitter.", "date": "November 06, 2022", "tags": ["Meta/Site News"], "featuredImage": "https://media.eagereyes.org/wp-content/uploads/2022/11/mastodon-eagereyes.jpeg"}, {"path": "blog/2022/midjourney-is-a-trip", "title": "Midjourney is a Trip", "description": "Of the several AI-powered systems that can create images from text prompts, MidJourney is the most easily accessible one right now. I've had some fun playing with it.", "date": "June 28, 2022", "tags": [""], "featuredImage": "https://media.eagereyes.org/wp-content/uploads/2022/06/midjourney-teaser.jpg"}, {"path": "blog/2022/new-video-gauges-for-data-visualization-the-ny-times-election-needle-and-circular-bar-charts", "title": "New video: Gauges for Data Visualization, The NY Times Election Needle, and Circular Bar Charts", "description": "Gauges aren't very popular in visualization, but they have some interesting properties. There is, of course, the infamous NY Times \"election needle,\" but you're probably using gauges every day without giving them too much thought. There's also an interesting connection with circular bar charts, which I think can work well when used as part-to-whole charts. I talk about all of this in my new video.", "date": "May 17, 2022", "tags": ["eagereyestv"], "featuredImage": "https://media.eagereyes.org/wp-content/uploads/2022/05/Gauges-Thumbnail-4x3-1.jpeg"}, {"path": "blog/2022/watch-my-outlier-talk-this-should-have-been-a-bar-chart", "title": "Watch My Outlier Talk: This Should Have Been A Bar Chart!", "description": "I gave a talk at the Outlier conference earlier this year, with the somewhat elaborate title, The Joys – and Dangers – of Bespoke and Unusual Chart Types. Though I eventually decided to go with the much shorter, This Should Have Been A Bar Chart! You can watch it on YouTube now.", "date": "April 26, 2022", "tags": [""], "featuredImage": "https://media.eagereyes.org/wp-content/uploads/2022/04/outlier-talk.png"}, {"path": "blog/2022/paper-more-than-meets-the-eye-a-closer-look-at-encodings-in-visualization", "title": "Paper: More Than Meets the Eye: A Closer Look at Encodings in Visualization", "description": "Encodings play a central role in visualization, but I believe our thinking about them is too simplistic. In a new paper, I argue that we need to distinguish between the encodings that specify how a visualization is drawn and the ones that are readable or actually read by an observer. While they largely or entirely overlap in some charts (like bar charts or scatterplots) they don't in others (pie charts, line charts, etc.). And what exactly do you even specify in more complex visualizations like treemaps?", "date": "April 19, 2022", "tags": ["paper"], "featuredImage": "https://media.eagereyes.org/wp-content/uploads/2022/04/Kosara-CGA-2022b.png"}, {"path": "blog/2022/the-possible-stratagem-behind-the-biden-bar", "title": "The (Possible) Stratagem Behind the Biden Bar", "description": "A bar chart with a distorted vertical axis isn't very unusual. But what if that chart was posted by the White House and what if it was done on purpose – not to overstate the number shown, but rather to evoke a particular kind of response?", "date": "January 30, 2022", "tags": [""], "featuredImage": "https://media.eagereyes.org/wp-content/uploads/2022/01/economic-growth-1.jpeg"}, {"path": "blog/2022/the-ny-times-covid-spiral-is-off-center", "title": "The NY Times COVID Spiral Is Off-Center", "description": "An opinion piece in the New York Times last week got a lot of attention in visualization circles for its use of a spiral chart as its opener. While the choice of chart and color scheme can be debated, I want to discuss the fact that the spiral is disconcertingly off-center.", "date": "January 09, 2022", "tags": [""], "featuredImage": "https://media.eagereyes.org/wp-content/uploads/2022/01/spirals-overlaid.png"}, {"path": "blog/2021/new-video-the-science-of-pie-charts", "title": "New Video: The Science of Pie Charts", "description": "The common explanation for how pie charts work is that we read them by angle. That of course would mean that donut charts would be bad, because you can't see the angle when you take away the center of the pie. Changing the radius of a slice wouldn't matter though, because that doesn't change the angle. But there is no evidence that angle is how we read pie charts, quite the opposite actually. In this new video, I walk through five reasons why angle is not how we read pies, and what that means for other things we like to assume about them.", "date": "November 16, 2021", "tags": ["pie-charts", "eagereyestv"], "featuredImage": "https://media.eagereyes.org/wp-content/uploads/2021/11/Thumbnail-4x3-1.jpeg"}, {"path": "blog/2021/paper-from-jam-session-to-recital-synchronous-communication-and-collaboration-around-data-in-organizations", "title": "Paper: From Jam Session to Recital: Synchronous Communication and Collaboration Around Data in Organizations", "description": "Who are the people who use data and visualization as part of their work every day? In particular, how do people use data as part of meetings, to present to others, to discuss their findings and recommendations, etc.? My colleague Matt Brehmer and I ran a pair of studies to find out.", "date": "October 26, 2021", "tags": ["paper"], "featuredImage": "https://media.eagereyes.org/wp-content/uploads/2021/10/pexels-photo-3184292.jpeg"}, {"path": "blog/2021/eagereyes-turns-15", "title": "EagerEyes Turns 15", "description": "EagerEyes is 15 years old today! Rather than look back at 15 years of visualization and blogging (though I will do a little of that too), I want to reflect a bit on what blogging means today and where things are going.", "date": "October 01, 2021", "tags": ["Meta/Site News"], "featuredImage": "https://media.eagereyes.org/wp-content/uploads/2021/09/eagereyes-xv.jpeg"}, {"path": "blog/2021/can-a-timeline-pie-chart-work", "title": "Can A Timeline Pie Chart Work?", "description": "Can you put ranked data into a pie chart that also represents time? This chart tries, and I think it succeeds.", "date": "September 15, 2021", "tags": [""], "featuredImage": "https://media.eagereyes.org/wp-content/uploads/2021/09/california-wildfires-thumb.jpeg"}, {"path": "blog/2021/new-video-chart-appreciation-iraqs-bloody-toll-by-simon-scarr", "title": "New video: Chart Appreciation, Iraq's Bloody Toll by Simon Scarr", "description": "How do you make people not just see numbers when looking at a chart, but feel something? This chart of the number of deaths during the Iraq war has always given me a visceral response like no other, and it’s still as powerful as when it was made almost ten years ago. So I made a chart appreciation video to explain what I think is so great about it.", "date": "July 22, 2021", "tags": ["eagereyestv"], "featuredImage": "https://media.eagereyes.org/wp-content/uploads/2021/07/Iraq-Thumbnail-Blog.jpg"}, {"path": "blog/2021/when-the-wrong-chart-is-the-right-choice", "title": "When the Wrong Chart Is the Right Choice", "description": "We all agree that the direction of the bars in a bar chart should correspond to the direction in which the values grow. Or do we? When it comes to running or audio recording and processing, it turns out that the seemingly wrong choice can be the right one – because a more semantically meaningful representation can help us understand and use the data much more easily.", "date": "June 27, 2021", "tags": [""], "featuredImage": "https://media.eagereyes.org/wp-content/uploads/2021/06/undeararmour-bars.jpeg"}, {"path": "blog/2021/new-video-linear-vs-quadratic-change", "title": "New Video: Linear vs. Quadratic Change", "description": "Scaling objects to represent a value is a key part of visualization, but it's not without its pitfalls. Especially when it comes to fancy infographic bar charts, it can easily distort the value's appearance. Why that is, and where else this can happen, isn't always obvious. In my new video, I show how it happens and how to do it right – and how this issue inspired ISOTYPE.", "date": "June 15, 2021", "tags": ["eagereyestv"], "featuredImage": "https://media.eagereyes.org/wp-content/uploads/2021/06/LvQ-Thumbnail.jpeg"}, {"path": "blog/2021/new-video-florence-nightingales-famous-rose-chart-aka-coxcomb", "title": "New video: Florence Nightingale's Famous Rose Chart (aka \"Coxcomb\")", "description": "It's Florence Nightingale's 201st birthday tomorrow! Since I missed her 200th, I figured I'd make a video about her famous chart. What made it tick? What was it about? Who was Nightingale, anyway?", "date": "May 11, 2021", "tags": ["eagereyestv"], "featuredImage": "https://media.eagereyes.org/wp-content/uploads/2021/05/Nightingale-Thumbnail.jpeg"}, {"path": "blog/2021/new-video-chart-appreciation-black-vs-white-boys-and-the-punishing-reach-of-racism", "title": "New video: Chart Appreciation, Black vs. White Boys and The Punishing Reach of Racism", "description": "Dots fly across the screen, some of them moving up, some down. They represent black and white boys, and how their income differs from that of their parents and from each other. It's a great way to show this data in an engaging way and without having to explain percentiles. This is a chart appreciation.", "date": "April 20, 2021", "tags": ["eagereyestv"], "featuredImage": "https://media.eagereyes.org/wp-content/uploads/2021/04/Black-and-White-Boys-Thumb.jpeg"}]